#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whip-up/csharp-clean-architecture-github-action/runs/run-ZBqjd4gpX473FjS6

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_region.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
aws_iam_role.task: Refreshing state... [id=terraform-20230427135024309700000002]
data.aws_vpc.this: Refreshing...
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster]
aws_ecr_repository.dot-net-architecture: Refreshing state... [id=clean-slice]
data.aws_region.current: Refresh complete after 0s [id=ap-southeast-2]
data.aws_caller_identity.current: Refresh complete after 0s [id=467945566648]
aws_iam_role_policy.task: Refreshing state... [id=terraform-20230427135024309700000002:terraform-20230427135024933600000004]
aws_iam_role_policy_attachment.task[0]: Refreshing state... [id=terraform-20230427135024309700000002-20230427135025049600000005]
data.aws_vpc.this: Refresh complete after 2s [id=vpc-d23709b5]
data.aws_subnets.this: Refreshing...
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11]
aws_security_group.this: Refreshing state... [id=sg-0e1ef5e8e637d4a4f]
data.aws_subnets.this: Refresh complete after 1s [id=ap-southeast-2]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c]
aws_acm_certificate.temporary: Refreshing state... [id=arn:aws:acm:ap-southeast-2:467945566648:certificate/4a94a317-0d0f-4aed-92f8-323572c35daf]
aws_lb.this: Drift detected (update)
aws_acm_certificate.temporary: Drift detected (update)
aws_ecr_repository.dot-net-architecture: Drift detected (update)
aws_iam_role.task: Drift detected (update)
aws_lb_target_group.this: Drift detected (update)
aws_security_group.this: Drift detected (update)
aws_ecs_cluster.this: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_acm_certificate.temporary has changed
  ~ resource "aws_acm_certificate" "temporary" {
      + arn                       = "arn:aws:acm:ap-southeast-2:467945566648:certificate/4a94a317-0d0f-4aed-92f8-323572c35daf"
        id                        = "arn:aws:acm:ap-southeast-2:467945566648:certificate/4a94a317-0d0f-4aed-92f8-323572c35daf"
        tags                      = {
            "Environment" = "Temporary"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.temporary is tainted, so must be replaced
+/- resource "aws_acm_certificate" "temporary" {
      ~ arn                       = "arn:aws:acm:ap-southeast-2:467945566648:certificate/4a94a317-0d0f-4aed-92f8-323572c35daf" -> (known after apply)
      ~ domain_name               = "*.amazonaws.com" -> "clean-slice-alb-1163462058.ap-southeast-2.elb.amazonaws.com"
      ~ domain_validation_options = [
          + {
              + domain_name           = "clean-slice-alb-1163462058.ap-southeast-2.elb.amazonaws.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ap-southeast-2:467945566648:certificate/4a94a317-0d0f-4aed-92f8-323572c35daf" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "INELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "FAILED" -> (known after apply)
      ~ subject_alternative_names = [
          - "*.amazonaws.com",
          + "clean-slice-alb-1163462058.ap-southeast-2.elb.amazonaws.com",
        ]
        tags                      = {
            "Environment" = "Temporary"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "clean-slice"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "clean-slice"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0e1ef5e8e637d4a4f",
            ]
          + subnets          = [
              + "subnet-2770e17f",
              + "subnet-cda3b384",
              + "subnet-f7df3991",
            ]
        }
    }

  # aws_ecs_task_definition.initiator will be created
  + resource "aws_ecs_task_definition" "initiator" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command      = [
                      + "/bin/sh -c \"echo '<html> <head> <title>Attention</title> <style>body {margin-top: 40px; background-color: #333;} </style> </head><body> <div style=color:white;text-align:center> <h1>clean-slice</h1>  <p>Your application is now running on a container in Amazon ECS. Allow pipeline to deploy application.</p> </div></body></html>' >  /usr/local/apache2/htdocs/index.html && httpd-foreground\"",
                    ]
                  + entryPoint   = [
                      + "sh",
                      + "-c",
                    ]
                  + image        = "httpd:2.4"
                  + name         = "clean-slice"
                  + portMappings = [
                      + {
                          + containerPort = 80
                        },
                    ]
                },
            ]
        )
      + execution_role_arn       = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002"
      + family                   = "clean-slice-task"
      + id                       = (known after apply)
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }
      + task_role_arn            = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002"
    }

  # aws_lb_listener.this will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Sorry, we could not find the resource you were looking for. Please check your request and try again."
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.this will be created
  + resource "aws_lb_listener_rule" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11"
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/api/*",
                ]
            }
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + aws_ecs_service      = (known after apply)

```

</details>

*Pushed by: @jonyeezs*